

#ifndef _ZSSEGDLL_H
#define _ZSSEGDLL_H


#ifndef WIN32
#define __declspec(dllexport)
#endif


#ifdef __cplusplus
extern "C"{
#endif

#include <stdio.h>
#include <stdlib.h>
#include <string.h>



/*************************************************  GetDictHandle ******************************************************
//功能:得到分词词典句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pDict			字典句柄
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long GetDictHandle(void*& pDictHnd/*out*/);

/*************************************************  GetSegHandle ******************************************************
//功能:得到分词对象句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pZSSeg			分词句柄		
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long GetSegHandle(void* pDictHnd/*in*/,void*& pZSSegHnd/*out*/);

/*************************************************  GetZSSegHandle *****************************************************
//功能:得到分词句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pDict			字典句柄
	pZSSeg			分词句柄		
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long GetZSSegHandle(void*& pDictHnd/*out*/,void*& pZSSegHnd/*out*/);


/*************************************************  ZSBufSeg *****************************************************
//功能：切分输入buf
//返回值：返回结果buf的字节长度
//参数说明：
	szInBuf			要切分的buf
	lInBufLen		要切分buf的字节长度
	szOutBuf		切分结果buf
	lOutBufLen		结果buf的可用长度
	pZSSeg			分词句柄
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long ZSSegBuf(char* szInBuf/*in*/,long lInBufLen/*in*/,char* szOutBuf/*out*/,long lOutBufLen/*in*/,void* pZSSeg/*in*/);

/**********************************************  ZSSegBufPOSTagging *************************************************
//功能：切分输入buf
//返回值：返回结果buf的字节长度
//参数说明：
	szInBuf			要切分的buf
	lInBufLen		要切分buf的字节长度
	szOutBuf		切分结果buf
	lOutBufLen		结果buf的可用长度
	pZSSegHnd		分词句柄
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long ZSSegBufPOSTagging(char* szInBuf/*in*/,long lInBufLen/*in*/,char* szOutBuf/*out*/,long lOutBufLen/*in*/,void* pZSSegHnd/*in*/);

/*************************************************  FreeZSSegHandle *****************************************************
//功能:释放使用的句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pDict			字典句柄
	pZSSeg			分词句柄		
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long FreeZSSegHandle(void* pDictHnd/*in*/,void* pZSSegHnd/*in*/);

/***********************************************  FreeDictHandle ***************************************************
//功能:释放使用的词典句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pDict			字典句柄		
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long FreeDictHandle(void* pDictHnd/*in*/);


/***********************************************  FreeSegHandle ***************************************************
//功能:释放使用的分词对象句柄
//返回值：成功返回0，失败返回-1
//参数说明：
	pZSSeg			分词对象句柄		
//程序员：樊云红 高志
//创建日期：2005-07-20
//最终修改日期：
******************************************************************************************************************/
__declspec(dllexport)
long FreeSegHandle(void* pZSSegHnd/*in*/);

#ifdef __cplusplus
}
#endif

#endif
